// 자바 클래스 이름 생성 규칙
// 1. 클래스의 이름은 영문자로 사용함(한글도 사용 가능은 함, 관례적으로 영어만 사용)
// 2. 영문 대소문자를 구분함
// 3. 특수문자를 이름으로 사용할 수 없음 ($, _ 는 사용가능)
// 4. 숫자는 이름으로 사용가능 하나, 첫번째 글자로는 쓸 수 없음
// 5. 자바 키워드를 이름으로 사용할 수 없음
// 6. 2개 이상의 단어를 연결하여 이름을 작성할 때, 단어의 첫번째 글자는 대문자, 나머지 글자는 소문자로 사용
// 7. 파일이름과 클래스이름은 같아야 함


// 자바는 모든 소스가 클래스에 포함됨
// 일반적으로 1개의 파일은 1개의 클래스로 구성

//public class StudentTest { //--> 파일명과 클래스명이 동일해야 public 선언할 수 있음
//}

// new 연산자
// 1. 클래스명()는 생성자를 호출하는 코드
// 2. 생성된 객체는 힙 메모리영역에 생성
// 3. 객체 생성 후, 객체의 주소를 되돌려(리턴)준다.
// 클래스타입 객체명 = new 클래스명();     ex) Car3 myCar = new Car3();

// 클래스의 용도
// 1. 실행용 : main() 메소드를 가지고 있는 클래스
// 2. 라이브러리 용 : 다른 클래스에서 이용할 목적으로 만든 클래스


public class Student{

}